In [1]:
from sqlalchemy import create_engine
import numpy as np
import pandas as pd

In [2]:
engine = create_engine("mysql+pymysql://root:pass@localhost:8791/imdb")

In [3]:
# What is the mean score of all "Action" movies and "Comedy" movies, and how many titles are there of each genre? 
# Rename the "average_rating" column to "mean_score" and round to 4 decimal places. Rename the title count to "total_titles".

df1: pd.DataFrame = pd.read_sql_query(
    f"""
    SELECT 
      genre, 
      ROUND(AVG(average_rating), 4) AS mean_score, 
      COUNT(ratings.title_id) AS total_titles
    FROM ratings 
    JOIN genres 
      ON ratings.title_id = genres.title_id
    WHERE genre = 'Action' or genre = 'Comedy'
    GROUP BY genre
    """,
    engine
    )

print(df1)

    genre  mean_score  total_titles
0  Comedy      6.9977        409127
1  Action      7.0232        162618

In [4]:
# What movies were directed by Clint Eastwood between 2010 and 2016? 

df2: pd.DataFrame = pd.read_sql_query(
    f"""
    SELECT primary_title, start_year
    FROM persons
    JOIN jobs 
      ON persons.person_id = jobs.person_id
    JOIN titles 
      ON jobs.title_id = titles.title_id
    WHERE first_name = 'Clint' 
    AND last_name = 'Eastwood' 
    AND category = 'director'
    AND start_year >= 2010
    AND start_year <= 2016
    """,
    engine
    )

print(df2)

     primary_title  start_year
0        Hereafter        2010
1         J. Edgar        2011
2      Jersey Boys        2014
3  American Sniper        2014
4            Sully        2016

In [5]:
# What is the average rating of each of the Lord of the Rings films? Show them in order of release date.

df3: pd.DataFrame = pd.read_sql_query(
    f"""
    SELECT primary_title, average_rating AS mean_score
    FROM titles
    JOIN ratings 
      ON titles.title_id = ratings.title_id
    WHERE primary_title LIKE %s
    AND title_type = 'movie'
    ORDER BY start_year
    """,
    engine,
    params=("The Lord of the Rings:%",)
    )

print(df3)

                                       primary_title  mean_score
0  The Lord of the Rings: The Fellowship of the Ring         8.8
1              The Lord of the Rings: The Two Towers         8.8
2      The Lord of the Rings: The Return of the King         9.0

In [6]:
# What movies are the cast of "The Matrix (1999)" known for? Display their first and last names, and each movie's primary title and runtime.

df4: pd.DataFrame = pd.read_sql_query(
    f"""
    WITH actors AS (
        SELECT first_name, last_name, kfts.title_id
        FROM titles 
        JOIN jobs 
        ON titles.title_id = jobs.title_id
        JOIN persons 
        ON jobs.person_id = persons.person_id
        JOIN known_for_titles AS kfts
        ON kfts.person_id = persons.person_id
        WHERE titles.primary_title LIKE %s
        AND titles.start_year = 1999
        AND (
            category = 'actor'
            OR 
            category = 'actress'
        )
    )
    SELECT first_name, last_name, primary_title, runtime_minutes
    FROM actors JOIN titles 
    ON actors.title_id = titles.title_id
    WHERE title_type = 'movie';
    """,
    engine,
    params=("%The Matrix%",)
    )

print(df4)

     first_name  last_name                                      primary_title
0         Keanu     Reeves                                        Point Break  \
1         Keanu     Reeves                                              Speed
2         Keanu     Reeves                                         The Matrix
3         Keanu     Reeves                                The Matrix Reloaded
4      Laurence  Fishburne                                         The Matrix
5      Laurence  Fishburne                                The Matrix Reloaded
6      Laurence  Fishburne                                       Mystic River
7      Laurence  Fishburne                                          Contagion
8   Carrie-Anne       Moss                                         The Matrix
9   Carrie-Anne       Moss                                            Memento
10  Carrie-Anne       Moss                             The Matrix Revolutions
11  Carrie-Anne       Moss                                               Fido
12         Hugo    Weaving  The Lord of the Rings: The Fellowship of the Ring
13         Hugo    Weaving      The Lord of the Rings: The Return of the King
14         Hugo    Weaving              The Lord of the Rings: The Two Towers
15         Hugo    Weaving                                     V for Vendetta
16        Chris   Connelly                                      The Bodyguard
17        Chris   Connelly                                   Last Action Hero

    runtime_minutes
0               122
1               116
2               136
3               138
4               136
5               138
6               138
7               106
8               136
9               113
10              129
11               93
12              178
13              201
14              179
15              132
16              129
17              130

In [7]:
# Assume a DataFrame of the form of the result in Question 2. 
# Sort it by "start_year" in descending order.

df2.sort_values(by=["start_year"], ascending=False)

     primary_title  start_year
4            Sully        2016
2      Jersey Boys        2014
3  American Sniper        2014
1         J. Edgar        2011
0        Hereafter        2010

In [8]:
# Assume a DataFrame of the form of the result in Question 3. 
# Remove the "The Lord of the Rings: " part of the string from each title.

df3["primary_title"] = df3["primary_title"].str.replace("The Lord of the Rings: ", "")
df3

                primary_title  mean_score
0  The Fellowship of the Ring         8.8
1              The Two Towers         8.8
2      The Return of the King         9.0

In [9]:
# Assume a DataFrame of the form of the result in Question 4. 
# Make the set of films each actor is known for into a list so that each actor has only one row and average the runtime minutes. 
# Set the respective column names to "titles" and "avg_runtime".

(
df4.groupby(["first_name", "last_name"])
    .agg({"primary_title" : lambda t: t.tolist(), "runtime_minutes" : "mean" })
    .rename(columns={"primary_title" : "titles", "runtime_minutes" : "avg_runtime"})
)

,,titles,avg_runtime
first_name,last_name,,
Carrie-Anne,Moss,"[The Matrix, Memento, The Matrix Revolutions, ...",117.75
Chris,Connelly,"[The Bodyguard, Last Action Hero]",129.50
Hugo,Weaving,[The Lord of the Rings: The Fellowship of the ...,172.50
Keanu,Reeves,"[Point Break, Speed, The Matrix, The Matrix Re...",128.00
Laurence,Fishburne,"[The Matrix, The Matrix Reloaded, Mystic River...",129.50